In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine("postgresql://postgres:Runt0thehill$$@191.252.184.52:5432/mrr")

In [3]:
df = pd.read_sql_table("pagamento", con=engine, schema="stage")
df = df.rename(columns={
    "cd_cliente":"nr_cliente",
})
df.head()

,index,nr_cliente,dt_pagamento,vl_pagamento,dia_pagamento,mes_pagamento,ano_pagamento,tp_plano,periodicidade
0,0,4049,2017-03-05,300.0,5,3,2017,Bronze,3
1,1,1711,2018-08-12,750.0,12,8,2018,Ouro,3
2,2,3643,2017-01-01,399.0,1,1,2017,Platina,1
3,3,4683,2017-06-09,2394.0,9,6,2017,Platina,6
4,4,4645,2018-04-25,250.0,25,4,2018,Ouro,1

In [4]:
cdf = pd.read_sql_table("cliente", con=engine, schema="stage", columns=["id", "cidade", "estado", "segmento"])
cdf = cdf.rename(columns={
    "id":"nr_cliente",
    "cidade":"nm_cidade",
    "estado":"nm_estado",
})
cdf = cdf.drop_duplicates()
cdf.head()

   nr_cliente     nm_cidade nm_estado    segmento
0           0  Cachoeirinha        PE   Confecção
1           0  Cachoeirinha        PE      Textil
2           1      Rio Doce        MG  Cosméticos
3           1      Rio Doce        MG  Perfumaria
4           1      Rio Doce        MG     Higiene

In [5]:
df = pd.merge(df, cdf, how="inner", on="nr_cliente")
del cdf
df.head()

,index,nr_cliente,dt_pagamento,vl_pagamento,dia_pagamento,mes_pagamento,ano_pagamento,tp_plano,periodicidade,nm_cidade,nm_estado,segmento
0,0,4049,2017-03-05,300.0,5,3,2017,Bronze,3,Santa Gertrudes,SP,Outro
1,13518,4049,2018-10-06,600.0,6,10,2018,Bronze,6,Santa Gertrudes,SP,Outro
2,17706,4049,2017-02-04,100.0,4,2,2017,Bronze,1,Santa Gertrudes,SP,Outro
3,19542,4049,2019-06-05,300.0,5,6,2019,Bronze,3,Santa Gertrudes,SP,Outro
4,26931,4049,2019-05-05,100.0,5,5,2019,Bronze,1,Santa Gertrudes,SP,Outro

In [6]:
clientedf = pd.read_sql_table("dashboard_dimcliente", con=engine, columns=["cd_cliente", "nr_cliente"])
clientedf.head()

   cd_cliente  nr_cliente
0           1        1304
1           2        4223
2           3         508
3           4         645
4           5        4555

In [7]:
df = pd.merge(df, clientedf, how="inner", on="nr_cliente")
del clientedf
df.head()

,index,nr_cliente,dt_pagamento,vl_pagamento,dia_pagamento,mes_pagamento,ano_pagamento,tp_plano,periodicidade,nm_cidade,nm_estado,segmento,cd_cliente
0,0,4049,2017-03-05,300.0,5,3,2017,Bronze,3,Santa Gertrudes,SP,Outro,2932
1,13518,4049,2018-10-06,600.0,6,10,2018,Bronze,6,Santa Gertrudes,SP,Outro,2932
2,17706,4049,2017-02-04,100.0,4,2,2017,Bronze,1,Santa Gertrudes,SP,Outro,2932
3,19542,4049,2019-06-05,300.0,5,6,2019,Bronze,3,Santa Gertrudes,SP,Outro,2932
4,26931,4049,2019-05-05,100.0,5,5,2019,Bronze,1,Santa Gertrudes,SP,Outro,2932

In [ ]:
df = df.sort_values(["cd_cliente", "dt_pagamento"])
lista = []
for index, row in df.iterrows():
    if row["periodicidade"] > 1:
        for enu, i in enumerate(range(row["periodicidade"]-1)):
            lista.append([row["dt_pagamento"] + pd.DateOffset(months=enu+1), row["periodicidade"], row["cd_cliente"], False, row["vl_mrr"], False, row["cd_localidade"], row["cd_plano"]])

In [8]:
df = df.groupby(["segmento", "tp_plano", "ano_pagamento", "mes_pagamento"])
df.head(20)

,index,nr_cliente,dt_pagamento,vl_pagamento,dia_pagamento,mes_pagamento,ano_pagamento,tp_plano,periodicidade,nm_cidade,nm_estado,segmento,cd_cliente
0,0,4049,2017-03-05,300.0,5,3,2017,Bronze,3,Santa Gertrudes,SP,Outro,2932
1,13518,4049,2018-10-06,600.0,6,10,2018,Bronze,6,Santa Gertrudes,SP,Outro,2932
2,17706,4049,2017-02-04,100.0,4,2,2017,Bronze,1,Santa Gertrudes,SP,Outro,2932
3,19542,4049,2019-06-05,300.0,5,6,2019,Bronze,3,Santa Gertrudes,SP,Outro,2932
4,26931,4049,2019-05-05,100.0,5,5,2019,Bronze,1,Santa Gertrudes,SP,Outro,2932
...,...,...,...,...,...,...,...,...,...,...,...,...,...
156584,95432,1943,2019-07-27,555.0,27,7,2019,Prata,3,Lucélia,SP,Música,3221
156585,95432,1943,2019-07-27,555.0,27,7,2019,Prata,3,Lucélia,SP,Som,3221
156597,95440,2479,2019-07-20,1197.0,20,7,2019,Platina,3,Jequeri,MG,Áudio,1607
156598,95440,2479,2019-07-20,1197.0,20,7,2019,Platina,3,Jequeri,MG,Música,1607
156599,95440,2479,2019-07-20,1197.0,20,7,2019,Platina,3,Jequeri,MG,Som,1607